{
  "name": "Arambourgiania",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Arambourgiania%2C_Nyctosaurus_and_Quetzalcoatlus_scale.jpg/960px-Arambourgiania%2C_Nyctosaurus_and_Quetzalcoatlus_scale.jpg",
<<<<<<< HEAD
  "overview": "Arambourgiania is a aerial reptile currently documented from an uncertain time interval with uncertain geographic attribution. Current interpretation suggests a carnivore feeding profile. It is typically classified as Pterosauria. Evidence quality for Arambourgiania is currently limited by specimen completeness and historical naming complexity. Dino-pedia tracks this taxon with conservative wording so future specimen-level studies can be integrated without overwriting uncertain claims.",
  "scientificData": {
    "type": "Aerial Reptile",
    "period": "Unknown",
    "diet": "Carnivore",
    "location": "Unknown",
    "classification": "Pterosauria",
    "discovered": "Unknown but probably established from fragmentary finds and later taxonomic revision",
    "length": "Unknown but probably within the size range of close relatives",
    "height": "Unknown but probably proportional to similarly sized close relatives",
    "weight": "Unknown but probably within the mass range of comparable close relatives",
    "speed": "Unknown but probably moderate for its body plan"
=======
  "overview": "Arambourgiania is a real prehistoric taxon included in Dino-pedia from published genus lists.",
  "scientificData": {
    "type": "Avian Reptile",
    "period": "Mesozoic",
    "diet": "Carnivore",
    "location": "Various regions",
    "classification": "Pterosauria",
    "discovered": "Summarized from published paleontological records",
    "length": "Estimated from fossil material and comparative reconstructions",
    "height": "Estimated from posture and skeletal proportions",
    "weight": "Estimated from scaling and biomechanical models",
    "speed": "Inferred from anatomy and locomotor modeling"
>>>>>>> eb5bc0419e2d2523b8f33fa53c68b9e22cb56935
  },
  "externalAppearance": {
    "skin": "External appearance is inferred from fossil evidence and close relatives.",
    "lips": "Soft tissue features remain uncertain and model-dependent.",
    "coloration": "Coloration is uncertain and inferred from ecology.",
    "displayStructures": "Likely used anatomical structures for display and recognition."
  },
  "huntingAndDiet": {
    "prey": [
<<<<<<< HEAD
      "Specific prey remains unknown for this taxon."
    ],
    "strategy": "Feeding strategy is interpreted from preserved anatomy and wear evidence, but remains uncertain.",
    "biteForce": "Direct bite-force values are not currently constrained by specimen-level biomechanical studies.",
    "cannibalism": "Cannibalism has not been demonstrated for this taxon with specimen-level trace evidence."
  },
  "feedingPatterns": {
    "dailyIntake": "Daily intake is unknown because species-level metabolic estimates are not yet reliable.",
    "feedingStyle": "Feeding style is uncertain and inferred from limited fossil evidence.",
    "preferredFood": "Ontogenetic dietary shifts are possible but not confirmed for this taxon.",
    "foodCompetition": "Competition pressure is uncertain and has not been directly quantified for this taxon."
  },
  "environment": {
    "formations": [
      "Known from fossil-bearing formations; exact assignment varies by specimen and revision."
    ],
    "climate": "Local climate remains uncertain and is reconstructed from incomplete environmental proxies.",
=======
      "Diet likely depended on habitat and trophic role"
    ],
    "strategy": "Feeding behavior likely reflected anatomy, age, and local ecosystem.",
    "biteForce": "Performance inferred from skull and muscle attachment morphology.",
    "cannibalism": "No broad consensus without specimen-specific trace evidence."
  },
  "feedingPatterns": {
    "dailyIntake": "Likely varied with body mass and ecosystem productivity.",
    "feedingStyle": "Likely combined opportunistic feeding with seasonal resource tracking.",
    "preferredFood": "Diet likely changed through growth stages.",
    "foodCompetition": "Likely competed with coexisting vertebrates for resources."
  },
  "environment": {
    "formations": [
      "Known from fossil-bearing Mesozoic formations"
    ],
    "climate": "Regional climate varied through time and locality.",
>>>>>>> eb5bc0419e2d2523b8f33fa53c68b9e22cb56935
    "flora": [
      "Conifers",
      "Ferns",
      "Early flowering plants"
    ],
    "juvenileThreats": [
<<<<<<< HEAD
      "Juvenile mortality pressure is uncertain and inferred rather than directly documented."
    ]
  },
  "behaviorAndConflict": {
    "socialBehavior": "Social behavior remains unresolved for this taxon.",
    "territoriality": "Territorial behavior is not yet strongly constrained for this taxon.",
    "mainRivals": "Specific ecological rivals are not firmly documented.",
    "combatEvidence": "Direct conflict evidence is currently limited for this taxon."
  },
  "reproduction": {
    "eggs": "Reproductive biology is still poorly constrained for this taxon.",
    "clutchSize": "Clutch size remains uncertain for this taxon.",
    "nesting": "Nesting strategy is inferred from broader clade patterns, but species-level evidence is limited.",
    "medullaryBone": "Species-level reproductive tissue evidence is currently lacking."
  },
  "breedingAndNesting": {
    "courtship": "Courtship behavior is inferred rather than directly observed.",
    "nestingCycle": "Breeding timing remains uncertain.",
    "parentalCare": "Parental care is not yet established for this taxon.",
    "hatchlingSurvival": "Hatchling survival rates are not directly known."
  },
  "physiology": {
    "heartRate": "Physiological values are inferred with broad uncertainty.",
    "heartMass": "Organ scaling is inferred from comparative models and remains uncertain.",
    "stomachAcidPH": "Digestive chemistry is not directly measurable from current evidence.",
    "digestiveLength": "Digestive anatomy remains incompletely constrained.",
    "coproliteSize": "Coprolite evidence is absent or inconclusive for this taxon."
  },
  "locomotionAndAthletics": {
    "gait": "Locomotor mode is inferred from skeletal proportions and remains uncertain.",
    "acceleration": "Acceleration has not yet been directly estimated.",
    "endurance": "Endurance behavior remains uncertain.",
    "maneuverability": "Maneuverability is inferred rather than directly measured."
  },
  "growthStages": {
    "hatchling": "Hatchling biology is poorly documented for this taxon.",
    "juvenile": "Juvenile niche separation is plausible but currently unconfirmed.",
    "adult": "Adult life-history profile is still incompletely known.",
    "oldAge": "Senescence patterns are not yet well constrained."
  },
  "biomechanics": {
    "skeletalStrength": "Biomechanical optimization is inferred from preserved material and remains uncertain.",
    "limbFunction": "Detailed limb-function modeling is currently limited.",
    "tailRole": "Tail function beyond balance remains uncertain."
  },
  "sensoryAndIntelligence": {
    "vision": "Visual acuity is not directly established.",
    "smell": "Olfactory performance is inferred from comparative anatomy and remains uncertain.",
    "hearing": "Hearing range is not directly measurable from current fossils.",
    "cognition": "Cognition is inferred from braincase comparisons and remains uncertain."
  },
  "fossilDiscoveryHistory": {
    "firstFinds": "Documented from published fossil discoveries and later taxonomic revision.",
    "majorDiscoveries": "New finds may change taxonomy and anatomical interpretation.",
    "researchMilestones": "Modern imaging and modeling continue to refine reconstruction quality.",
    "museumImpact": "Specimens remain important for research, curation, and public outreach."
  },
  "paleoecology": {
    "ecosystemRole": "Likely occupied a defined food-web role, though precise niche boundaries remain uncertain.",
    "coexistingFauna": "Coexisted with multiple vertebrate taxa; exact associations depend on locality.",
    "resourceDynamics": "Seasonality may have influenced distribution, but direct evidence is limited.",
    "nicheShifts": "Ontogenetic niche shift is possible but not firmly demonstrated."
  },
  "pathologies": {
    "injuries": "Pathology evidence is limited and specimen-dependent.",
    "stressDamage": "Stress markers may reflect locomotor load, but interpretation is uncertain.",
    "diseaseSignals": "Disease/pathology evidence is sparse for this taxon."
  },
  "molecularData": {
    "softTissue": "Molecular evidence is extremely rare and currently unavailable for most specimens.",
=======
      "Predation pressure was likely highest in early life stages"
    ]
  },
  "behaviorAndConflict": {
    "socialBehavior": "Behavior likely ranged from solitary movement to temporary grouping.",
    "territoriality": "Competition likely increased around nesting zones and dense resources.",
    "mainRivals": "Rivals included predators, competitors, or defended prey species.",
    "combatEvidence": "Injury evidence in related taxa indicates periodic conflict."
  },
  "reproduction": {
    "eggs": "Reproductive traits varied by clade and ecology.",
    "clutchSize": "Likely varied with body size and reproductive strategy.",
    "nesting": "Nesting likely balanced heat, drainage, and protection.",
    "medullaryBone": "Reproductive tissue evidence is known in some related lineages."
  },
  "breedingAndNesting": {
    "courtship": "Likely included visual and postural signaling.",
    "nestingCycle": "Likely seasonal and linked to climate and food availability.",
    "parentalCare": "Parental strategy likely varied by lineage.",
    "hatchlingSurvival": "Juveniles likely faced high early mortality pressure."
  },
  "physiology": {
    "heartRate": "Estimated by comparative physiology and allometric scaling.",
    "heartMass": "Likely scaled with body size and metabolic demand.",
    "stomachAcidPH": "Likely aligned with trophic strategy and digestive demands.",
    "digestiveLength": "Digestive profile likely reflected diet specialization.",
    "coproliteSize": "Coprolites provide indirect dietary evidence where preserved."
  },
  "locomotionAndAthletics": {
    "gait": "Locomotion reflected limb architecture and center-of-mass control.",
    "acceleration": "Burst performance depended on musculoskeletal design.",
    "endurance": "Range movement likely tracked seasonal resource gradients.",
    "maneuverability": "Turning and stability reflected body plan and tail/neck control."
  },
  "growthStages": {
    "hatchling": "Early stage with rapid development and high vulnerability.",
    "juvenile": "Likely occupied ecological roles that differed from adults.",
    "adult": "Mature stage with peak ecological and reproductive function.",
    "oldAge": "Late stage with cumulative skeletal wear and reduced performance."
  },
  "biomechanics": {
    "skeletalStrength": "Bone structure balanced strength, mass, and mobility.",
    "limbFunction": "Limb function reflected locomotor and ecological specialization.",
    "tailRole": "Tail likely supported balance, maneuvering, and signaling."
  },
  "sensoryAndIntelligence": {
    "vision": "Visual performance likely matched ecological and behavioral demands.",
    "smell": "Olfaction likely supported foraging and communication.",
    "hearing": "Auditory sensitivity likely captured environmental cues.",
    "cognition": "Behavior likely mixed instinctive patterns with adaptive responses."
  },
  "fossilDiscoveryHistory": {
    "firstFinds": "Known from published fossil discoveries and subsequent revision.",
    "majorDiscoveries": "Additional finds continue to refine taxonomy and anatomy.",
    "researchMilestones": "Imaging and biomechanical modeling improved reconstructions.",
    "museumImpact": "Specimens contribute to education and public science outreach."
  },
  "paleoecology": {
    "ecosystemRole": "Occupied a distinct role in local food webs.",
    "coexistingFauna": "Shared habitats with diverse contemporaneous vertebrates.",
    "resourceDynamics": "Seasonality likely influenced distribution and behavior.",
    "nicheShifts": "Ecological role likely shifted through ontogeny."
  },
  "pathologies": {
    "injuries": "Some fossils preserve trauma consistent with ecological stress.",
    "stressDamage": "Skeletal stress markers can reflect locomotor load.",
    "diseaseSignals": "Pathological evidence appears in selected specimens."
  },
  "molecularData": {
    "softTissue": "Molecular preservation is rare and context-dependent.",
>>>>>>> eb5bc0419e2d2523b8f33fa53c68b9e22cb56935
    "closestLivingRelatives": [
      "Birds",
      "Crocodilians (distant archosaur relatives)"
    ]
  },
  "stats": {
<<<<<<< HEAD
    "teeth": "Tooth counts and form are incompletely known for this taxon.",
    "maxTooth": "Maximum tooth size is uncertain due to incomplete material.",
    "eyeSize": "Eye-size estimates remain uncertain.",
    "tailWeight": "Tail-mass estimates remain uncertain."
  },
  "extinctionContext": {
    "timeline": "Survival history is interpreted from regional and global environmental change.",
    "primaryDrivers": "Extinction pressures likely involved environmental turnover and food-web instability.",
    "immediateEffects": "Habitat disruption likely reduced ecological stability near extinction intervals.",
    "legacy": "Ongoing discoveries continue to refine biodiversity reconstructions."
=======
    "teeth": "Tooth form and count varied by clade and ecology.",
    "maxTooth": "Largest tooth dimensions varied by position and age.",
    "eyeSize": "Orbit dimensions inform sensory interpretations.",
    "tailWeight": "Tail mass reflected balancing and locomotor function."
  },
  "extinctionContext": {
    "timeline": "Lineage persistence depended on regional and global change.",
    "primaryDrivers": "Environmental turnover and food-web shifts shaped survival.",
    "immediateEffects": "Habitat and resource disruption reduced ecological stability.",
    "legacy": "Fossils continue to refine Mesozoic biodiversity reconstructions."
>>>>>>> eb5bc0419e2d2523b8f33fa53c68b9e22cb56935
  },
  "funFacts": [
    "Arambourgiania is a real prehistoric taxon in Dino-pedia.",
    "New fossil finds can significantly update scientific reconstructions.",
    "Ontogeny likely changed ecological role and behavior."
  ],
  "images": [
    {
      "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Arambourgiania%2C_Nyctosaurus_and_Quetzalcoatlus_scale.jpg/960px-Arambourgiania%2C_Nyctosaurus_and_Quetzalcoatlus_scale.jpg",
      "caption": "Arambourgiania reference image"
    }
<<<<<<< HEAD
  ],
  "researchContext": {
    "evidenceBase": "Arambourgiania is represented by published fossil material, but completeness and diagnostic overlap can limit high-confidence biological reconstruction.",
    "currentLimits": "Several ecological and life-history traits remain inferential rather than directly measured for this taxon.",
    "nextDataNeeded": "Priority evidence includes better-preserved cranial/postcranial overlap, robust stratigraphic control, and specimen-linked morphometrics.",
    "revisionOutlook": "Interpretation is expected to improve as new finds and reanalyses clarify taxonomy and anatomy."
  }
}
=======
  ]
}
>>>>>>> eb5bc0419e2d2523b8f33fa53c68b9e22cb56935
